Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.singer_strokepredictor will be created
  + resource "aws_ecr_repository" "singer_strokepredictor" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "singer_strokepredictor"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "singer_strokepredictor"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "singer_strokepredictor"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
